---
kind: type
id: T:Autodesk.Revit.DB.Panel
zh: 面板
source: html/ad561307-a19c-9a8a-728d-5646e90b451b.htm
---
# Autodesk.Revit.DB.Panel

**中文**: 面板

This object represents a curtain panel.

## Syntax (C#)
```csharp
public class Panel : FamilyInstance
```

## Remarks
Inheritance Hierarchy System.Object    Autodesk.Revit.DB.Element      Autodesk.Revit.DB.Instance        Autodesk.Revit.DB.FamilyInstance          Autodesk.Revit.DB.Panel